{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Lambda", "config": {"arguments": {}, "name": "lambda_1", "output_shape_type": "raw", "output_shape": [72, 256, 3], "trainable": true, "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u0013model-mini-batch.py\u00da\b<lambda>\u0018\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "batch_input_shape": [null, 72, 256, 3]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "border_mode": "same", "nb_col": 5, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 24, "init": "normal", "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "border_mode": "same", "nb_col": 5, "b_constraint": null, "name": "convolution2d_2", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "border_mode": "same", "nb_col": 5, "b_constraint": null, "name": "convolution2d_3", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "dim_ordering": "tf", "border_mode": "same", "nb_col": 5, "b_constraint": null, "name": "convolution2d_4", "activity_regularizer": null, "trainable": true, "b_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "subsample": [1, 1], "W_regularizer": null, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_4", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "output_dim": 100, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "output_dim": 50, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_6", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "output_dim": 10, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"b_regularizer": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "output_dim": 1, "activation": "linear", "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "bias": true}}]}