{"config": [{"config": {"batch_input_shape": [null, 32, 32, 3], "name": "lambda_1", "output_shape": [32, 32, 3], "trainable": true, "input_dtype": "float32", "function_type": "lambda", "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0017\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "nb_filter": 24, "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "init": "normal", "name": "convolution2d_1", "dim_ordering": "tf", "nb_col": 5, "border_mode": "same", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "nb_filter": 36, "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "dim_ordering": "tf", "nb_col": 5, "border_mode": "same", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "nb_filter": 48, "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "dim_ordering": "tf", "nb_col": 5, "border_mode": "same", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "trainable": true, "b_constraint": null, "activation": "linear", "nb_row": 5, "bias": true, "nb_filter": 64, "subsample": [1, 1], "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "dim_ordering": "tf", "nb_col": 5, "border_mode": "same", "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"input_dim": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "b_constraint": null, "activation": "linear", "bias": true, "name": "dense_1", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"input_dim": null, "activity_regularizer": null, "output_dim": 50, "trainable": true, "b_constraint": null, "activation": "linear", "bias": true, "name": "dense_2", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"input_dim": null, "activity_regularizer": null, "output_dim": 10, "trainable": true, "b_constraint": null, "activation": "linear", "bias": true, "name": "dense_3", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"input_dim": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "b_constraint": null, "activation": "linear", "bias": true, "name": "dense_4", "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}