{"config": [{"config": {"input_dtype": "float32", "output_shape": [160, 320, 3], "name": "lambda_2", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-12-cf4fe01ea7f4>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "batch_input_shape": [null, 160, 320, 3], "output_shape_type": "raw", "arguments": {}, "trainable": true, "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "convolution2d_5", "b_constraint": null, "nb_filter": 24, "init": "normal", "W_constraint": null, "trainable": true, "border_mode": "same", "nb_row": 5, "subsample": [1, 1], "nb_col": 5, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_5", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "convolution2d_6", "b_constraint": null, "nb_filter": 36, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "border_mode": "same", "nb_row": 5, "subsample": [1, 1], "nb_col": 5, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_6", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_9", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "convolution2d_7", "b_constraint": null, "nb_filter": 48, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "border_mode": "same", "nb_row": 5, "subsample": [1, 1], "nb_col": 5, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_7", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_10", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "convolution2d_8", "b_constraint": null, "nb_filter": 64, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "border_mode": "same", "nb_row": 5, "subsample": [1, 1], "nb_col": 5, "activity_regularizer": null, "bias": true, "dim_ordering": "tf", "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_8", "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_11", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "dense_5", "b_constraint": null, "input_dim": null, "trainable": true, "output_dim": 100, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "elu_12", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "dense_6", "b_constraint": null, "input_dim": null, "trainable": true, "output_dim": 50, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "elu_13", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "dense_7", "b_constraint": null, "input_dim": null, "trainable": true, "output_dim": 10, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "elu_14", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"activation": "linear", "W_regularizer": null, "name": "dense_8", "b_constraint": null, "input_dim": null, "trainable": true, "output_dim": 1, "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "bias": true, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}