{"config": [{"config": {"name": "lambda_3", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-10-c3a1cd1a8d11>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [112, 224, 3], "arguments": {}, "batch_input_shape": [null, 112, 224, 3], "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "normal", "nb_filter": 24, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_9", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_9", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_15", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_filter": 36, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_10", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_16", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_filter": 48, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_11", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_11", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_17", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_filter": 64, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_12", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_12", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_18", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 100, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_9", "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_19", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 50, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_10", "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_20", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 10, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_11", "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_21", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_12", "trainable": true, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}