{"keras_version": "1.1.2", "config": [{"config": {"batch_input_shape": [null, 85, 320, 3], "output_shape": [85, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000emodel-final.py\u00da\b<lambda>=\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "output_shape_type": "raw", "function_type": "lambda", "input_dtype": "float32", "name": "lambda_1", "arguments": {}}, "class_name": "Lambda"}, {"config": {"init": "normal", "subsample": [1, 1], "nb_col": 5, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "border_mode": "same", "bias": true, "name": "convolution2d_1", "activity_regularizer": null, "b_constraint": null, "nb_filter": 24, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_col": 5, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "border_mode": "same", "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "b_constraint": null, "nb_filter": 36, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_col": 5, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "border_mode": "same", "bias": true, "name": "convolution2d_3", "activity_regularizer": null, "b_constraint": null, "nb_filter": 48, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "subsample": [1, 1], "nb_col": 5, "activation": "linear", "dim_ordering": "tf", "nb_row": 5, "border_mode": "same", "bias": true, "name": "convolution2d_4", "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "W_constraint": null, "W_regularizer": null, "trainable": true, "b_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "name": "maxpooling2d_4", "dim_ordering": "tf", "strides": [2, 2], "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "bias": true, "name": "dense_1", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 100, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "bias": true, "name": "dense_2", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 50, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "bias": true, "name": "dense_3", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 10, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "input_dim": null, "trainable": true, "activation": "linear", "bias": true, "name": "dense_4", "activity_regularizer": null, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "output_dim": 1, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}