{"config": [{"config": {"name": "lambda_1", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001e<ipython-input-5-76bda511b2c0>\u00da\b<lambda>\u0003\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [128, 256, 3], "arguments": {}, "batch_input_shape": [null, 128, 256, 3], "input_dtype": "float32", "output_shape_type": "raw", "function_type": "lambda"}, "class_name": "Lambda"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "normal", "nb_filter": 24, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_1", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_filter": 36, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_2", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_filter": 48, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_3", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "nb_filter": 64, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "nb_col": 5, "bias": true, "name": "convolution2d_4", "trainable": true, "dim_ordering": "tf", "nb_row": 5, "b_constraint": null, "border_mode": "same", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_4", "trainable": true, "dim_ordering": "tf", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 100, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_1", "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 50, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_2", "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 10, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_3", "trainable": true, "b_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "input_dim": null, "bias": true, "name": "dense_4", "trainable": true, "b_constraint": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}