{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"name": "lambda_1", "input_dtype": "float32", "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u000emodel-comma.py\u00da\b<lambda>T\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape_type": "raw", "arguments": {}, "output_shape": [128, 256, 3], "batch_input_shape": [null, 128, 256, 3], "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "b_constraint": null, "nb_col": 8, "nb_row": 8, "border_mode": "same", "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 16, "subsample": [4, 4], "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "b_constraint": null, "nb_col": 5, "nb_row": 5, "border_mode": "same", "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 32, "subsample": [2, 2], "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "b_constraint": null, "nb_col": 5, "nb_row": 5, "border_mode": "same", "activation": "linear", "dim_ordering": "tf", "W_constraint": null, "bias": true, "init": "glorot_uniform", "W_regularizer": null, "nb_filter": 64, "subsample": [2, 2], "trainable": true, "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_1", "W_constraint": null, "bias": true, "output_dim": 512, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_2", "W_constraint": null, "bias": true, "output_dim": 1, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "trainable": true}}], "keras_version": "1.1.2"}