{"config": [{"config": {"batch_input_shape": [null, 128, 256, 3], "name": "lambda_1", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\tmodel6.py\u00da\b<lambda>8\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "arguments": {}, "function_type": "lambda", "output_shape": [128, 256, 3], "output_shape_type": "raw", "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"activity_regularizer": null, "nb_row": 5, "nb_filter": 24, "trainable": true, "activation": "linear", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "bias": true, "name": "convolution2d_1", "b_regularizer": null, "nb_col": 5, "init": "uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_row": 5, "nb_filter": 36, "trainable": true, "activation": "linear", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "bias": true, "name": "convolution2d_2", "b_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_row": 5, "nb_filter": 48, "trainable": true, "activation": "linear", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "bias": true, "name": "convolution2d_3", "b_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "nb_row": 5, "nb_filter": 64, "trainable": true, "activation": "linear", "border_mode": "same", "W_constraint": null, "subsample": [1, 1], "bias": true, "name": "convolution2d_4", "b_regularizer": null, "nb_col": 5, "init": "glorot_uniform", "W_regularizer": null, "dim_ordering": "tf", "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "name": "maxpooling2d_4", "trainable": true, "border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "name": "dense_1", "output_dim": 100, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "name": "dense_2", "output_dim": 50, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "name": "dense_3", "output_dim": 10, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null, "W_regularizer": null, "input_dim": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.1.2"}